# Skullmonkeys / Neverhood game-specific vocabulary
# Compiled from: manual.md, official-enemy-names.md, sprite identifications,
# entity-event-ids.md, ScummVM Neverhood engine class names.
#
# These tokens are HIGH PRIORITY when building compound names.
# Format: one word per line, uppercase.

# --- Engine prefixes (from ScummVM Neverhood class names) ---
AS
SS
SPR
ANIM
SEQ
ICON
TEX
PAL
SND
SFX
MUS
BG
FX

# --- Player / hero ---
KLAYMEN
KLAY
KLAYMAN
CLAY
CLAYMAN
PLAYER
HERO
WILLIE
WILLY
DOUG
HOBORG
TRIBE

# --- Skullmonkeys-specific characters ---
SKULL
SKULLMONKEY
SKULLMONKEYS
MONKEY
MONKEYS
MAGE
MONKEYMAGE
SHRINEY
SHRINEYGUARD
GUARD
JOE
JOEHEAD
JHJ
GLENN
GLEN
YNTIS
YNT
WIZZ
WIZARD
KLOGG
KLOG
KING
KINGSKULLMONKEY
MACHINE
SKULLMACHINE

# --- Enemies (manual) ---
KEEPER
CLAYKEEPER
LOUDMOUTH
LOUD
MOUTH
MENTAL
MENTALMONKEY
TEMPEST
PULSATING
JUMPY
GORILLA
JUMPYGORILLA
TRIPLE
LASER
TRIPLELASER
BARFO
ELBARFO
BARF
FLAPPER
FLAP
JX
JX1137
TESTPILOT
PILOT
ROCKETPACK
ROCKET
BOMBER
BOMB
MONK
ROYAL
ROYALGUARD
ROYALMONK
ROBOT
HOVER
ROBOTHOVER
SHOOTER
HEADSHOOTER
FORKSHOOTER
FORK
SNOBLO
SNO
BLO
EGGBEATER
EGG
BEATER
PROPELLER
CASTLETROOPER
TROOPER
CASTLE
SPEAR
PIPECLEANER
PIPE
CLEANER
TONGUE
WORM
INFERNO
POPCORN
POPCORNSKULL
WORKER
WORKERYNT
CENTURION
SWARM
BARKINGBIRD
BARKING

# --- Items / collectibles (manual) ---
BULLET
BULLETS
GREENBULLET
GREENBULLETS
GREEN
ENERGY
ENERGYBALL
AMMO
PHOENIX
PHOENIXHAND
HAND
SEEKER
PHART
FART
PHARTHEAD
FARTCLONE
CLONE
GAS
UNIVERSE
ENEMA
SUPER
SUPERPOWER
UNIVERSEENEMA
HALO
SHIELD
HAMSTER
HAMSTERSHIELD
GLIDEY
YELLOWBIRD
YELLOW
GLIDE
GLIDER
SUPERWILLIE
SPIN
BUTT
BOUNCE
BUTTBOUNCE
JUMP

# --- 1-up / health ---
ONEUP
EXTRALIFE
LIFE
KLAYMENHEAD
KLAYHEAD
SWIRLY
SWIRLYQ
ICON1970
CHECKPOINT
CHECKPNT
SPARKLE
SPARK
TWINKLE
HEART
GREENHEART
CHEVRON
YELLOWCHEVRON
ORB
GEM

# --- Bosses ---
FATTY
FATTYBOOM
BOOM
FIFI
MICHAEL
DACENNA
GORDO
FETUS
BABY
IDOL
DEMON
DEVIL
EVIL
ENEMY
ENEMIES

# --- Objects ---
PLATFORM
MOVPLATFORM
MOVINGPLATFORM
MOVPLAT
PLAT
MOVING
LIFT
CLOCK
CLOCKPLAT
VIRTUAL
VIRTUALPLAT
BALL
BALLS
CATCHBALL
SPIKEBALL
SPIKYBALL
KLOGGBALL
TREASURE
TREASUREBALL
TELEPORT
TELEPORTBALL
PORTAL
WARP
EXIT
DOOR
KEY
BUTTON
SWITCH
LEVER
CRATE
BLOCK
BARREL
SPRING
TRAMPOLINE
BOUNCY
SPIKE
SPIKES
SAW
FAN
WHEEL
TURRET
GUN

# --- Effects / particles ---
DEBRIS
PARTICLE
PARTICLES
EXPLOSION
EXPLODE
POOF
BURST
POP
SMOKE
FLASH
DUST
SPLASH
GORE
BLOOD
GOO
SLIME
MUCUS
BUBBLE
FIRE
FLAME
WATER
GLOW
SHINE
GLINT
STAR
RING
WAVE
TRAIL
STREAK
SHARD
FRAGMENT
ICE
FROST
LIGHTNING
BOLT
ZAP
MIST
FOG
BEAM
RAY
SPAWN

# --- UI text ---
MENU
OPTIONS
TITLE
LOGO
FONT
TEXT
DIGIT
DIGITS
NUMBER
NUMBERS
GLYPH
GLYPHS
CURSOR
POINTER
ARROW
SELECTOR
CREDIT
CREDITS
PASSWORD
INTRO
OUTRO
ENDING
GAMEOVER
GAME
DEMO
LOADING
LOAD
PRESS
START
PAUSE
PAUSED
QUIT
CONTINUE
YES
NO
BG
BACKGROUND
BACKDROP
FRAME
BORDER
BANNER
PANEL

# --- Body parts ---
HEAD
BODY
TAIL
WING
WINGS
HORN
HORNS
EYE
EYES
TEETH
TOOTH
NOSE
EAR
EARS
ARM
ARMS
LEG
LEGS
FOOT
FEET
FINGER
TOE
HAIR
BEARD
SKIN
BONE
STOMACH
BELLY
CHEST
TORSO
WAIST
HIP
NECK
BACK
FRONT
PIECE
PIECES
LIMB
PART
PARTS

# --- Levels (4-letter codes from BLB header) ---
MENU
PHRO
SCIE
TMPL
FINN
MEGA
BOIL
SNOW
FOOD
HEAD
BRG1
GLID
CAVE
WEED
EGGS
GLEN
CLOU
SEVN
SOAR
CRYS
CSTL
WIZZ
RUNN
MOSS
KLOG
EVIL

# --- Movie codes ---
DREA
DREAM
LOGO
ELEC
INT1
INT2
GASS
YAMM
REDD
YNTS
EYES
END1
END2

# --- Action verbs ---
WALK
WALKING
RUN
RUNNING
JUMP
JUMPING
FALL
FALLING
LAND
LANDING
DIE
DEATH
DEAD
DYING
HURT
HIT
DAMAGE
PAIN
SHOOT
FIRE
FIRING
ATTACK
ATK
ATTACKING
SLAM
SLAMMING
OPEN
OPENING
CLOSE
CLOSING
BEGIN
END
ENTER
TURN
TURNING
EAT
EATING
SLEEP
SLEEPING
WAKE
ROLL
ROLLING
SLIDE
SLIDING
FLY
FLYING
GLIDING
SPINNING
SPIT
SPITTING
HOCK
HOCKING
LOOGEY
YELL
YELLING
SCREAM
SCREAMING
TAUNT
VICTORY
WIN
LOSE
DANCE
IDLE
REST
WAIT
STAND
STANDING

# --- Frame numbers and directions ---
LEFT
RIGHT
UP
DOWN
NORTH
SOUTH
EAST
WEST
TOP
BOTTOM
MIDDLE
CENTER
CENTRE
INNER
OUTER
INSIDE
OUTSIDE
FRONT
BACK
REAR

# --- Common modifiers ---
MIRROR
MIRRORED
FLIP
FLIPPED
ROT
ROTATE
ROTATED
SCALE
SCALED
NEW
OLD
ALT
VARIANT
VAR
BASE
COMMON
RARE
UNIQUE
BIG
SMALL
TINY
LARGE
HUGE
MAIN
SUB
AUX
EXTRA

# --- Misc Skullmonkeys flavor ---
KING
GAME
CD
FMV
MOVIE
FOOTAGE
SCENE
ROOM
AREA
SCREEN
LEVEL
STAGE
WORLD
ZONE
MAP

# --- Numbered suffixes ---
00
01
02
03
04
05
06
07
08
09
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
30
40
50
99
A
B
C
D
E
F
G
H
1
2
3
4
5
6
7
8
9
0
